wagiminator/Development-Boards/STC8H8K64U_DevBoard/software/reset/include/gpio.h
// ===================================================================================
// Basic GPIO, PWM and ADC Functions for STC8H8K64U Series Microcontrollers   * v1.0 *
// ===================================================================================
//
// Pins must be defined as P10, P11, P12, etc. - e.g.:
// #define PIN_LED P34      // LED on pin P3.4
//
// PIN functions available:
// ------------------------
// PIN_input(PIN)           set PIN as INPUT (high impedance, no pullup) (*)
// PIN_input_PU(PIN)        set PIN as INPUT with internal PULLUP
// PIN_output(PIN)          set PIN as OUTPUT (push-pull)
// PIN_output_OD(PIN)       set PIN as OUTPUT (open-drain, no pullup)
// PIN_output_OD_PU(PIN)    set PIN as OUTPUT (open-drain, internal pullup)
// PIN_bidirect(PIN)        set PIN as quasi-bidirectional I/O (weak pull-up)
//
// PIN_pullup(PIN)          enable internal 4k1 PULLUP on PIN
// PIN_pulloff(PIN)         disable internal 4k1 PULLUP on PIN (*)
// PIN_fast(PIN)            set fast level shifting on PIN
// PIN_slow(PIN)            set slow level shifting on PIN (*)
// PIN_enable(PIN)          enable digital input on PIN (*)
// PIN_disable(PIN)         disable digital input on PIN
// PIN_strong(PIN)          set enhanced drive current ability on PIN
// PIN_weak(PIN)            set general drive current ability on PIN (*)
// PIN_ST_enable(PIN)       enable schmitt trigger function on PIN (*)
// PIN_ST_disable(PIN)      disable schmitt trigger function on PIN
//
// PIN_low(PIN)             set PIN output value to LOW
// PIN_high(PIN)            set PIN output value to HIGH (*)
// PIN_toggle(PIN)          TOGGLE PIN output value
// PIN_read(PIN)            read PIN input value
// PIN_write(PIN, val)      write PIN output value (0 = LOW / 1 = HIGH)
//
// PIN_asm(PIN)             convert PIN for inline assembly: setb PIN_asm(PIN_LED)
// PIN_set(PIN)             convert PIN for direct manipulation: PIN_set(PIN_LED) = 1;
//
// PIN_all_bidirect()       set all pins as quasi-bidirectional I/O
// PIN_all_enable()         enable digital input on all pins
// PIN_all_disable()        disable digital input on all pins
//
// PORT functions available:
// -------------------------
// PORT_input(PORT)         set PORT as INPUT
// PORT_output(PORT)        set PORT as OUTPUT (push-pull)
// PORT_output_OD(PORT)     set PORT as OUTPUT (open-drain)
// PORT_bidirect(PORT)      set PORT as quasi-bidirectional I/O
//
// PORT_pullup(PORT)        enable internal 4k1 PULLUP on PORT
// PORT_pulloff(PORT)       disable internal 4k1 PULLUP on PORT (*)
// PORT_fast(PORT)          set fast level shifting on PORT
// PORT_slow(PORT)          set slow level shifting on PORT (*)
// PORT_enable(PORT)        enable digital input on PORT (*)
// PORT_disable(PORT)       disable digital input on PORT
// PORT_strong(PORT)        set enhanced drive current ability on PORT
// PORT_weak(PORT)          set general drive current ability on PORT (*)
// PORT_ST_enable(PORT)     enable schmitt trigger function on PORT (*)
// PORT_ST_disable(PORT)    disable schmitt trigger function on PORT
//
// PORT_low(PORT)           set PORT output value to LOW
// PORT_high(PORT)          set PORT output value to HIGH (*)
// PORT_toggle(PORT)        TOGGLE PORT output value
// PORT_read(PORT)          read PORT input value
// PORT_write(PORT, val)    write PORT output value
//
// PWM functions available:
// ------------------------
// PWM_init()               init PWMA timer
// PWM_start(PIN)           start PWM output on PIN (P10 - P27, P33, P34 only)
// PWM_stop(PIN)            stop PWM output on PIN
// PWM_write(PIN, val)      set PWM output active level duty cycle on PIN (0 - 255)
//
// ADC functions available:
// ------------------------
// ADC_init()               init and enable ADC
// ADC_enable()             enable ADC
// ADC_disable()            disable ADC
// ADC_fast()               set ADC fast mode (less accurate) (*)
// ADC_slow()               set ADC slow mode (more accurate)
// ADC_input(PIN)           set ADC input pin (see below for valid pins)
// ADC_read()               sample and read ADC value (0 - 4095)
// ADC_read_VDD()           sample and read VREF, calculate and return VDD in mV
//
// Comparator functions available:
// -------------------------------
// CMP_enable()             enable comparator
// CMP_disable()            disable comparator
// CMP_pos_pin(PIN)         set CMP non-inverting input pin (P37 and ADC input pins only)
// CMP_neg_pin(PIN)         set CMP inverting input pin (P36 only)
// CMP_neg_VREF()           set VREF (1.19V) as inverting input
// CMP_out_pin(PIN)         set CMP output pin (P34, P41 only)
// CMP_out_enable()         enable CMP output on pin
// CMP_out_disable()        disable CMP output on pin
// CMP_out_invert()         invert CMP output
// CMP_out_noninvert()      normal CMP output (*)
// CMP_read()               read CMP output (0: pos < neg, 1: pos > neg, if not inverted)
//
// Notes:
// ------
// (*) default reset state.
// Pins used for PWM should be set as OUTPUT beforehand.
// Not all PWM pins work independently of each other. Refer to the datasheet for more info.
// Pins used for ADC or CMP input must have been set as INPUT (high impedance) beforehand.
// ADC-pins: P00 - P06, P10, P11, P13 - P17, P54.
// If ADC input pins are used for the CMP, ADC and CMP must be enabled.
// Access to extended registers must be granted (P_SW2 |= 0x80;).
//
// 2023 by Stefan Wagner:   https://github.com/wagiminator

#pragma once
#include "stc8h.h"

// ===================================================================================
// Enumerate pin designators (use these designators to define pins)
// ===================================================================================

enum{ P00, P01, P02, P03, P04, P05, P06, P07, P10, P11, P12, P13, P14, P15, P16, P17,
      P20, P21, P22, P23, P24, P25, P26, P27, P30, P31, P32, P33, P34, P35, P36, P37,
      P40, P41, P42, P43, P44, P45, P46, P47, P50, P51, P52, P53, P54, P55, P56, P57,
      P60, P61, P62, P63, P64, P65, P66, P67, P70, P71, P72, P73, P74, P75, P76, P77 };

// ===================================================================================
// Helper Defines (these are for internal use only)
// ===================================================================================

// 2nd-stage glue defines
#define PIN_h_a(PIN) _P##PIN
#define PIN_h_s(PIN) P##PIN

