wagiminator/Development-Boards/STC8H8K64U_DevBoard/software/reset/include/gpio.h
#define PORT_h_in(PORT)     (P##PORT##M1 = 0xff, P##PORT##M0 = 0x00)  // input
#define PORT_h_pp(PORT)     (P##PORT##M1 = 0x00, P##PORT##M0 = 0xff)  // output push-pull
#define PORT_h_od(PORT)     (P##PORT##M1 = 0xff, P##PORT##M0 = 0xff)  // output open-drain
#define PORT_h_bi(PORT)     (P##PORT##M1 = 0x00, P##PORT##M0 = 0x00)  // bidirectional

#define PORT_h_pe(PORT)     (P##PORT##PU  = 0xff)     // pullup enable
#define PORT_h_pd(PORT)     (P##PORT##PU  = 0x00)     // pullup disable
#define PORT_h_sd(PORT)     (P##PORT##NCS = 0xff)     // schmitt trigger disable
#define PORT_h_se(PORT)     (P##PORT##NCS = 0x00)     // schmitt trigger enable
#define PORT_h_ss(PORT)     (P##PORT##SR  = 0xff)     // slow speed
#define PORT_h_sf(PORT)     (P##PORT##SR  = 0x00)     // fast speed
#define PORT_h_dg(PORT)     (P##PORT##DR  = 0xff)     // general drive current
#define PORT_h_de(PORT)     (P##PORT##DR  = 0x00)     // enhanced drive current
#define PORT_h_ie(PORT)     (P##PORT##IE  = 0xff)     // digital input enable
#define PORT_h_id(PORT)     (P##PORT##IE  = 0x00)     // digital input disable

#define PORT_h_l(PORT)      P##PORT = 0x00            // port low
#define PORT_h_h(PORT)      P##PORT = 0xff            // port high
#define PORT_h_t(PORT)      P##PORT = -(P##PORT)      // port toggle
#define PORT_h_r(PORT)      (P##PORT)                 // read port
#define PORT_h_w(PORT,val)  P##PORT = val             // write port

// ===================================================================================
// Set pin as INPUT (high impedance, no pullup)
// ===================================================================================
#define PIN_input(PIN) \
  ((PIN>=P00)&&(PIN<=P07) ? (P0M1 |=  (1<<(PIN&7)), P0M0 &= ~(1<<(PIN&7)), P0PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P10)&&(PIN<=P17) ? (P1M1 |=  (1<<(PIN&7)), P1M0 &= ~(1<<(PIN&7)), P1PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P20)&&(PIN<=P27) ? (P2M1 |=  (1<<(PIN&7)), P2M0 &= ~(1<<(PIN&7)), P2PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P30)&&(PIN<=P37) ? (P3M1 |=  (1<<(PIN&7)), P3M0 &= ~(1<<(PIN&7)), P3PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P40)&&(PIN<=P47) ? (P4M1 |=  (1<<(PIN&7)), P4M0 &= ~(1<<(PIN&7)), P4PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P50)&&(PIN<=P57) ? (P5M1 |=  (1<<(PIN&7)), P5M0 &= ~(1<<(PIN&7)), P5PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P60)&&(PIN<=P67) ? (P6M1 |=  (1<<(PIN&7)), P6M0 &= ~(1<<(PIN&7)), P6PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P70)&&(PIN<=P77) ? (P7M1 |=  (1<<(PIN&7)), P7M0 &= ~(1<<(PIN&7)), P7PU &= ~(1<<(PIN&7))) : \
(0)))))))))

#define PIN_input_HI    PIN_input
#define PIN_input_FL    PIN_input
#define PIN_input_AN    PIN_input

// ===================================================================================
// Set pin as INPUT with internal 4k1 PULLUP resistor
// ===================================================================================
#define PIN_input_PU(PIN) \
  ((PIN>=P00)&&(PIN<=P07) ? (P0M1 |=  (1<<(PIN&7)), P0M0 &= ~(1<<(PIN&7)), P0PU |=  (1<<(PIN&7))) : \
  ((PIN>=P10)&&(PIN<=P17) ? (P1M1 |=  (1<<(PIN&7)), P1M0 &= ~(1<<(PIN&7)), P1PU |=  (1<<(PIN&7))) : \
  ((PIN>=P20)&&(PIN<=P27) ? (P2M1 |=  (1<<(PIN&7)), P2M0 &= ~(1<<(PIN&7)), P2PU |=  (1<<(PIN&7))) : \
  ((PIN>=P30)&&(PIN<=P37) ? (P3M1 |=  (1<<(PIN&7)), P3M0 &= ~(1<<(PIN&7)), P3PU |=  (1<<(PIN&7))) : \
  ((PIN>=P40)&&(PIN<=P47) ? (P4M1 |=  (1<<(PIN&7)), P4M0 &= ~(1<<(PIN&7)), P4PU |=  (1<<(PIN&7))) : \
  ((PIN>=P50)&&(PIN<=P57) ? (P5M1 |=  (1<<(PIN&7)), P5M0 &= ~(1<<(PIN&7)), P5PU |=  (1<<(PIN&7))) : \
  ((PIN>=P60)&&(PIN<=P67) ? (P6M1 |=  (1<<(PIN&7)), P6M0 &= ~(1<<(PIN&7)), P6PU |=  (1<<(PIN&7))) : \
  ((PIN>=P70)&&(PIN<=P77) ? (P7M1 |=  (1<<(PIN&7)), P7M0 &= ~(1<<(PIN&7)), P7PU |=  (1<<(PIN&7))) : \
(0)))))))))

// ===================================================================================
// Set pin as OUTPUT (push-pull)
// ===================================================================================
#define PIN_output(PIN) \
  ((PIN>=P00)&&(PIN<=P07) ? (P0M1 &= ~(1<<(PIN&7)), P0M0 |=  (1<<(PIN&7)), P0PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P10)&&(PIN<=P17) ? (P1M1 &= ~(1<<(PIN&7)), P1M0 |=  (1<<(PIN&7)), P1PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P20)&&(PIN<=P27) ? (P2M1 &= ~(1<<(PIN&7)), P2M0 |=  (1<<(PIN&7)), P2PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P30)&&(PIN<=P37) ? (P3M1 &= ~(1<<(PIN&7)), P3M0 |=  (1<<(PIN&7)), P3PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P40)&&(PIN<=P47) ? (P4M1 &= ~(1<<(PIN&7)), P4M0 |=  (1<<(PIN&7)), P4PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P50)&&(PIN<=P57) ? (P5M1 &= ~(1<<(PIN&7)), P5M0 |=  (1<<(PIN&7)), P5PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P60)&&(PIN<=P67) ? (P6M1 &= ~(1<<(PIN&7)), P6M0 |=  (1<<(PIN&7)), P6PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P70)&&(PIN<=P77) ? (P7M1 &= ~(1<<(PIN&7)), P7M0 |=  (1<<(PIN&7)), P7PU &= ~(1<<(PIN&7))) : \
(0)))))))))

#define PIN_output_PP   PIN_output

// ===================================================================================
// Set pin as OPEN-DRAIN OUTPUT (no pullup)
// ===================================================================================
#define PIN_output_OD(PIN) \
  ((PIN>=P00)&&(PIN<=P07) ? (P0M1 |=  (1<<(PIN&7)), P0M0 |=  (1<<(PIN&7)), P0PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P10)&&(PIN<=P17) ? (P1M1 |=  (1<<(PIN&7)), P1M0 |=  (1<<(PIN&7)), P1PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P20)&&(PIN<=P27) ? (P2M1 |=  (1<<(PIN&7)), P2M0 |=  (1<<(PIN&7)), P2PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P30)&&(PIN<=P37) ? (P3M1 |=  (1<<(PIN&7)), P3M0 |=  (1<<(PIN&7)), P3PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P40)&&(PIN<=P47) ? (P4M1 |=  (1<<(PIN&7)), P4M0 |=  (1<<(PIN&7)), P4PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P50)&&(PIN<=P57) ? (P5M1 |=  (1<<(PIN&7)), P5M0 |=  (1<<(PIN&7)), P5PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P60)&&(PIN<=P67) ? (P6M1 |=  (1<<(PIN&7)), P6M0 |=  (1<<(PIN&7)), P6PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P70)&&(PIN<=P77) ? (P7M1 |=  (1<<(PIN&7)), P7M0 |=  (1<<(PIN&7)), P7PU &= ~(1<<(PIN&7))) : \
(0)))))))))

// ===================================================================================
// Set pin as OPEN-DRAIN OUTPUT with internal 4k1 PULLUP resistor
// ===================================================================================
#define PIN_output_OD_PU(PIN) \
  ((PIN>=P00)&&(PIN<=P07) ? (P0M1 |=  (1<<(PIN&7)), P0M0 |=  (1<<(PIN&7)), P0PU |=  (1<<(PIN&7))) : \
  ((PIN>=P10)&&(PIN<=P17) ? (P1M1 |=  (1<<(PIN&7)), P1M0 |=  (1<<(PIN&7)), P1PU |=  (1<<(PIN&7))) : \
  ((PIN>=P20)&&(PIN<=P27) ? (P2M1 |=  (1<<(PIN&7)), P2M0 |=  (1<<(PIN&7)), P2PU |=  (1<<(PIN&7))) : \
  ((PIN>=P30)&&(PIN<=P37) ? (P3M1 |=  (1<<(PIN&7)), P3M0 |=  (1<<(PIN&7)), P3PU |=  (1<<(PIN&7))) : \
  ((PIN>=P40)&&(PIN<=P47) ? (P4M1 |=  (1<<(PIN&7)), P4M0 |=  (1<<(PIN&7)), P4PU |=  (1<<(PIN&7))) : \
  ((PIN>=P50)&&(PIN<=P57) ? (P5M1 |=  (1<<(PIN&7)), P5M0 |=  (1<<(PIN&7)), P5PU |=  (1<<(PIN&7))) : \
  ((PIN>=P60)&&(PIN<=P67) ? (P6M1 |=  (1<<(PIN&7)), P6M0 |=  (1<<(PIN&7)), P6PU |=  (1<<(PIN&7))) : \
  ((PIN>=P70)&&(PIN<=P77) ? (P7M1 |=  (1<<(PIN&7)), P7M0 |=  (1<<(PIN&7)), P7PU |=  (1<<(PIN&7))) : \
(0)))))))))

// ===================================================================================
// Set PIN as quasi-bidirectional I/O (weak pull-up)
// ===================================================================================
#define PIN_bidirect(PIN) \
  ((PIN>=P00)&&(PIN<=P07) ? (P0M1 &= ~(1<<(PIN&7)), P0M0 &= ~(1<<(PIN&7)), P0PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P10)&&(PIN<=P17) ? (P1M1 &= ~(1<<(PIN&7)), P1M0 &= ~(1<<(PIN&7)), P1PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P20)&&(PIN<=P27) ? (P2M1 &= ~(1<<(PIN&7)), P2M0 &= ~(1<<(PIN&7)), P2PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P30)&&(PIN<=P37) ? (P3M1 &= ~(1<<(PIN&7)), P3M0 &= ~(1<<(PIN&7)), P3PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P40)&&(PIN<=P47) ? (P4M1 &= ~(1<<(PIN&7)), P4M0 &= ~(1<<(PIN&7)), P4PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P50)&&(PIN<=P57) ? (P5M1 &= ~(1<<(PIN&7)), P5M0 &= ~(1<<(PIN&7)), P5PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P60)&&(PIN<=P67) ? (P6M1 &= ~(1<<(PIN&7)), P6M0 &= ~(1<<(PIN&7)), P6PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P70)&&(PIN<=P77) ? (P7M1 &= ~(1<<(PIN&7)), P7M0 &= ~(1<<(PIN&7)), P7PU &= ~(1<<(PIN&7))) : \
(0)))))))))

// ===================================================================================
// Enable internal 4k1 PULLUP on PIN
// ===================================================================================
#define PIN_pullup(PIN) \
  ((PIN>=P00)&&(PIN<=P07) ? (P0PU |=  (1<<(PIN&7))) : \
  ((PIN>=P10)&&(PIN<=P17) ? (P1PU |=  (1<<(PIN&7))) : \
  ((PIN>=P20)&&(PIN<=P27) ? (P2PU |=  (1<<(PIN&7))) : \
  ((PIN>=P30)&&(PIN<=P37) ? (P3PU |=  (1<<(PIN&7))) : \
  ((PIN>=P40)&&(PIN<=P47) ? (P4PU |=  (1<<(PIN&7))) : \
  ((PIN>=P50)&&(PIN<=P57) ? (P5PU |=  (1<<(PIN&7))) : \
  ((PIN>=P60)&&(PIN<=P67) ? (P6PU |=  (1<<(PIN&7))) : \
  ((PIN>=P70)&&(PIN<=P77) ? (P7PU |=  (1<<(PIN&7))) : \
(0)))))))))

// ===================================================================================
// Disable internal 4k1 PULLUP on PIN
// ===================================================================================
#define PIN_pulloff(PIN) \
  ((PIN>=P00)&&(PIN<=P07) ? (P0PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P10)&&(PIN<=P17) ? (P1PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P20)&&(PIN<=P27) ? (P2PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P30)&&(PIN<=P37) ? (P3PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P40)&&(PIN<=P47) ? (P4PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P50)&&(PIN<=P57) ? (P5PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P60)&&(PIN<=P67) ? (P6PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P70)&&(PIN<=P77) ? (P7PU &= ~(1<<(PIN&7))) : \
(0)))))))))

// ===================================================================================
// Set fast level shifting on PIN
// ===================================================================================
#define PIN_fast(PIN) \
  ((PIN>=P00)&&(PIN<=P07) ? (P0SR &= ~(1<<(PIN&7))) : \
  ((PIN>=P10)&&(PIN<=P17) ? (P1SR &= ~(1<<(PIN&7))) : \
  ((PIN>=P20)&&(PIN<=P27) ? (P2SR &= ~(1<<(PIN&7))) : \
  ((PIN>=P30)&&(PIN<=P37) ? (P3SR &= ~(1<<(PIN&7))) : \
  ((PIN>=P40)&&(PIN<=P47) ? (P4SR &= ~(1<<(PIN&7))) : \
  ((PIN>=P50)&&(PIN<=P57) ? (P5SR &= ~(1<<(PIN&7))) : \
  ((PIN>=P60)&&(PIN<=P67) ? (P6SR &= ~(1<<(PIN&7))) : \
  ((PIN>=P70)&&(PIN<=P77) ? (P7SR &= ~(1<<(PIN&7))) : \
(0)))))))))

// ===================================================================================
// Set slow level shifting on PIN
// ===================================================================================
#define PIN_slow(PIN) \
  ((PIN>=P00)&&(PIN<=P07) ? (P0SR |=  (1<<(PIN&7))) : \
  ((PIN>=P10)&&(PIN<=P17) ? (P1SR |=  (1<<(PIN&7))) : \
  ((PIN>=P20)&&(PIN<=P27) ? (P2SR |=  (1<<(PIN&7))) : \
  ((PIN>=P30)&&(PIN<=P37) ? (P3SR |=  (1<<(PIN&7))) : \
  ((PIN>=P40)&&(PIN<=P47) ? (P4SR |=  (1<<(PIN&7))) : \
  ((PIN>=P50)&&(PIN<=P57) ? (P5SR |=  (1<<(PIN&7))) : \
  ((PIN>=P60)&&(PIN<=P67) ? (P6SR |=  (1<<(PIN&7))) : \
  ((PIN>=P70)&&(PIN<=P77) ? (P7SR |=  (1<<(PIN&7))) : \
(0)))))))))

// ===================================================================================
// Enable digital input on PIN
// ===================================================================================
#define PIN_enable(PIN) \
  ((PIN>=P00)&&(PIN<=P07) ? (P0IE |=  (1<<(PIN&7))) : \
  ((PIN>=P10)&&(PIN<=P17) ? (P1IE |=  (1<<(PIN&7))) : \
  ((PIN>=P20)&&(PIN<=P27) ? (P2IE |=  (1<<(PIN&7))) : \
  ((PIN>=P30)&&(PIN<=P37) ? (P3IE |=  (1<<(PIN&7))) : \
  ((PIN>=P40)&&(PIN<=P47) ? (P4IE |=  (1<<(PIN&7))) : \
  ((PIN>=P50)&&(PIN<=P57) ? (P5IE |=  (1<<(PIN&7))) : \
  ((PIN>=P60)&&(PIN<=P67) ? (P6IE |=  (1<<(PIN&7))) : \
  ((PIN>=P70)&&(PIN<=P77) ? (P7IE |=  (1<<(PIN&7))) : \
(0)))))))))

// ===================================================================================
// Disable digital input on PIN
// ===================================================================================
#define PIN_disable(PIN) \
  ((PIN>=P00)&&(PIN<=P07) ? (P0IE &= ~(1<<(PIN&7))) : \
  ((PIN>=P10)&&(PIN<=P17) ? (P1IE &= ~(1<<(PIN&7))) : \
  ((PIN>=P20)&&(PIN<=P27) ? (P2IE &= ~(1<<(PIN&7))) : \
  ((PIN>=P30)&&(PIN<=P37) ? (P3IE &= ~(1<<(PIN&7))) : \
  ((PIN>=P40)&&(PIN<=P47) ? (P4IE &= ~(1<<(PIN&7))) : \
  ((PIN>=P50)&&(PIN<=P57) ? (P5IE &= ~(1<<(PIN&7))) : \
  ((PIN>=P60)&&(PIN<=P67) ? (P6IE &= ~(1<<(PIN&7))) : \
  ((PIN>=P70)&&(PIN<=P77) ? (P7IE &= ~(1<<(PIN&7))) : \
(0)))))))))

// ===================================================================================
// Set enhanced drive current ability on PIN
// ===================================================================================
#define PIN_strong(PIN) \
  ((PIN>=P00)&&(PIN<=P07) ? (P0DR &= ~(1<<(PIN&7))) : \
  ((PIN>=P10)&&(PIN<=P17) ? (P1DR &= ~(1<<(PIN&7))) : \
  ((PIN>=P20)&&(PIN<=P27) ? (P2DR &= ~(1<<(PIN&7))) : \
  ((PIN>=P30)&&(PIN<=P37) ? (P3DR &= ~(1<<(PIN&7))) : \
  ((PIN>=P40)&&(PIN<=P47) ? (P4DR &= ~(1<<(PIN&7))) : \
  ((PIN>=P50)&&(PIN<=P57) ? (P5DR &= ~(1<<(PIN&7))) : \
  ((PIN>=P60)&&(PIN<=P67) ? (P6DR &= ~(1<<(PIN&7))) : \
  ((PIN>=P70)&&(PIN<=P77) ? (P7DR &= ~(1<<(PIN&7))) : \
(0)))))))))

// ===================================================================================
// Set general drive current ability on PIN
// ===================================================================================
#define PIN_weak(PIN) \
  ((PIN>=P00)&&(PIN<=P07) ? (P0DR |=  (1<<(PIN&7))) : \
  ((PIN>=P10)&&(PIN<=P17) ? (P1DR |=  (1<<(PIN&7))) : \
  ((PIN>=P20)&&(PIN<=P27) ? (P2DR |=  (1<<(PIN&7))) : \
  ((PIN>=P30)&&(PIN<=P37) ? (P3DR |=  (1<<(PIN&7))) : \
  ((PIN>=P40)&&(PIN<=P47) ? (P4DR |=  (1<<(PIN&7))) : \
  ((PIN>=P50)&&(PIN<=P57) ? (P5DR |=  (1<<(PIN&7))) : \
  ((PIN>=P60)&&(PIN<=P67) ? (P6DR |=  (1<<(PIN&7))) : \
  ((PIN>=P70)&&(PIN<=P77) ? (P7DR |=  (1<<(PIN&7))) : \
(0)))))))))

// ===================================================================================
// Enable schmitt trigger function on PIN
// ===================================================================================
#define PIN_ST_enable(PIN) \
  ((PIN>=P00)&&(PIN<=P07) ? (P0NCS &= ~(1<<(PIN&7))) : \
  ((PIN>=P10)&&(PIN<=P17) ? (P1NCS &= ~(1<<(PIN&7))) : \
  ((PIN>=P20)&&(PIN<=P27) ? (P2NCS &= ~(1<<(PIN&7))) : \
  ((PIN>=P30)&&(PIN<=P37) ? (P3NCS &= ~(1<<(PIN&7))) : \
  ((PIN>=P40)&&(PIN<=P47) ? (P4NCS &= ~(1<<(PIN&7))) : \
  ((PIN>=P50)&&(PIN<=P57) ? (P5NCS &= ~(1<<(PIN&7))) : \
  ((PIN>=P60)&&(PIN<=P67) ? (P6NCS &= ~(1<<(PIN&7))) : \
  ((PIN>=P70)&&(PIN<=P77) ? (P7NCS &= ~(1<<(PIN&7))) : \
(0)))))))))

// ===================================================================================
// Disable schmitt trigger function on PIN
// ===================================================================================
#define PIN_ST_disable(PIN) \
  ((PIN>=P00)&&(PIN<=P07) ? (P0NCS |=  (1<<(PIN&7))) : \
  ((PIN>=P10)&&(PIN<=P17) ? (P1NCS |=  (1<<(PIN&7))) : \
  ((PIN>=P20)&&(PIN<=P27) ? (P2NCS |=  (1<<(PIN&7))) : \
  ((PIN>=P30)&&(PIN<=P37) ? (P3NCS |=  (1<<(PIN&7))) : \
  ((PIN>=P40)&&(PIN<=P47) ? (P4NCS |=  (1<<(PIN&7))) : \
  ((PIN>=P50)&&(PIN<=P57) ? (P5NCS |=  (1<<(PIN&7))) : \
  ((PIN>=P60)&&(PIN<=P67) ? (P6NCS |=  (1<<(PIN&7))) : \
  ((PIN>=P70)&&(PIN<=P77) ? (P7NCS |=  (1<<(PIN&7))) : \
(0)))))))))

// ===================================================================================
// Combined PIN settings
// ===================================================================================
#define PIN_all_bidirect()  { P0M1 = 0x00; P0M0 = 0x00; P1M1 = 0x00; P1M0 = 0x00; \
                              P2M1 = 0x00; P2M0 = 0x00; P3M1 = 0x00; P3M0 = 0x00; \
                              P4M1 = 0x00; P4M0 = 0x00; P5M1 = 0x00; P5M0 = 0x00; \
                              P6M1 = 0x00; P6M0 = 0x00; P7M1 = 0x00; P7M0 = 0x00; }
#define PIN_all_enable()    { P0IE = 0xff; P1IE = 0xff; P2IE = 0xff; P3IE = 0xff; \
                              P4IE = 0xff; P5IE = 0xff; P6IE = 0xff; P7IE = 0xff; }
#define PIN_all_disable()   { P0IE = 0x00; P1IE = 0x00; P2IE = 0x00; P3IE = 0x00; \
                              P4IE = 0x00; P5IE = 0x00; P6IE = 0x00; P7IE = 0x00; }

// ===================================================================================
// PIN manipulation macros
// ===================================================================================
#define PIN_low(PIN)          PIN_h_s(PIN) = 0              // set pin to LOW
#define PIN_high(PIN)         PIN_h_s(PIN) = 1              // set pin to HIGH
#define PIN_toggle(PIN)       PIN_h_s(PIN) = !PIN_h_s(PIN)  // TOGGLE pin
#define PIN_read(PIN)         (PIN_h_s(PIN))                // READ pin
#define PIN_write(PIN, val)   PIN_h_s(PIN) = val            // WRITE pin value

// ===================================================================================
// Convert PIN for inline assembly and direct manipulation
// ===================================================================================
#define PIN_asm(PIN)          PIN_h_a(PIN)
#define PIN_set(PIN)          PIN_h_s(PIN)

// ===================================================================================
// PORT manipulation macros
// ===================================================================================
#define PORT_input(PORT)      PORT_h_in(PORT)       // set PORT as INPUT
#define PORT_output(PORT)     PORT_h_pp(PORT)       // set PORT as OUTPUT PUSH_PULL
#define PORT_output_OD(PORT)  PORT_h_od(PORT)       // set PORT as OUTPUT OPEN-DRAIN
#define PORT_bidirect(PORT)   PORT_h_bi(PORT)       // set PORT as QUASI_BIDIRECT

#define PORT_pullup(PORT)     PORT_h_pe(PORT)       // pullup enable
#define PORT_pulloff(PORT)    PORT_h_pd(PORT)       // pullup disable
#define PORT_slow(PORT)       PORT_h_ss(PORT)       // slow speed
#define PORT_fast(PORT)       PORT_h_sf(PORT)       // fast speed
#define PORT_weak(PORT)       PORT_h_dg(PORT)       // general drive current
#define PORT_strong(PORT)     PORT_h_de(PORT)       // enhanced drive current
#define PORT_enable(PORT)     PORT_h_ie(PORT)       // digital input enable
#define PORT_disable(PORT)    PORT_h_id(PORT)       // digital input disable
#define PORT_ST_enable(PORT)  PORT_h_se(PORT)       // schmitt trigger enable
#define PORT_ST_disable(PORT) PORT_h_sd(PORT)       // schmitt trigger disable

#define PORT_low(PORT)        PORT_h_l(PORT)        // set PORT to LOW
#define PORT_high(PORT)       PORT_h_h(PORT)        // set PORT to HIGH
#define PORT_toggle(PORT)     PORT_h_t(PORT)        // TOGGLE PORT
#define PORT_read(PORT)       PORT_h_r(PORT)        // READ PORT
#define PORT_write(PORT,val)  PORT_h_w(PORT,val)    // WRITE PORT value

// ===================================================================================
// Basic PWM functions
// ===================================================================================

inline void PWM_init() {
  PWMA_CCER1 = 0x00;        // close channels first
  PWMA_CCER2 = 0x00;
  PWMA_CCMR1 = 0x60;        // set PWMA output mode
  PWMA_CCMR2 = 0x60;
  PWMA_CCMR3 = 0x60;
  PWMA_CCMR4 = 0x60;
  PWMA_CCER1 = 0x55;        // re-enable channels
  PWMA_CCER2 = 0x55;
  PWMA_ARRH  = 0x00;        // set period
  PWMA_ARRL  = 0xff;
  PWMA_CCR1H = 0x00;        // clear duty cycle high bytes
  PWMA_CCR2H = 0x00;
  PWMA_CCR3H = 0x00;
  PWMA_CCR4H = 0x00;
  PWMA_BKR   = 0x80;        // enable main output
  PWMA_CR1   = 0x01;        // enable counter
}

