wagiminator/Development-Boards/STC8H8K64U_DevBoard/software/reset/include/gpio.h
#define PWM_start(PIN) \
  ((PIN == P10) ? (PWMA_PS &= 0xfc,                  PWMA_ENO |= 0x01) : \
  ((PIN == P11) ? (PWMA_PS &= 0xfc,                  PWMA_ENO |= 0x02) : \
  ((PIN == P12) ? (PWMA_PS &= 0xf3,                  PWMA_ENO |= 0x04) : \
  ((PIN == P13) ? (PWMA_PS &= 0xf3,                  PWMA_ENO |= 0x08) : \
  ((PIN == P14) ? (PWMA_PS &= 0xcf,                  PWMA_ENO |= 0x10) : \
  ((PIN == P15) ? (PWMA_PS &= 0xcf,                  PWMA_ENO |= 0x20) : \
  ((PIN == P16) ? (PWMA_PS &= 0x3f,                  PWMA_ENO |= 0x40) : \
  ((PIN == P17) ? (PWMA_PS &= 0x3f,                  PWMA_ENO |= 0x80) : \
  ((PIN == P20) ? (PWMA_PS &= 0xfc, PWMA_PS |= 0x01, PWMA_ENO |= 0x01) : \
  ((PIN == P21) ? (PWMA_PS &= 0xfc, PWMA_PS |= 0x01, PWMA_ENO |= 0x02) : \
  ((PIN == P22) ? (PWMA_PS &= 0xf3, PWMA_PS |= 0x04, PWMA_ENO |= 0x04) : \
  ((PIN == P23) ? (PWMA_PS &= 0xf3, PWMA_PS |= 0x04, PWMA_ENO |= 0x08) : \
  ((PIN == P24) ? (PWMA_PS &= 0xcf, PWMA_PS |= 0x10, PWMA_ENO |= 0x10) : \
  ((PIN == P25) ? (PWMA_PS &= 0xcf, PWMA_PS |= 0x10, PWMA_ENO |= 0x20) : \
  ((PIN == P26) ? (PWMA_PS &= 0x3f, PWMA_PS |= 0x40, PWMA_ENO |= 0x40) : \
  ((PIN == P27) ? (PWMA_PS &= 0x3f, PWMA_PS |= 0x40, PWMA_ENO |= 0x80) : \
  ((PIN == P34) ? (                 PWMA_PS |= 0xc0, PWMA_ENO |= 0x40) : \
  ((PIN == P33) ? (                 PWMA_PS |= 0xc0, PWMA_ENO |= 0x80) : \
(0)))))))))))))))))))

#define PWM_stop(PIN) \
  ((PIN == P10) ? (PWMA_ENO &= ~0x01) : \
  ((PIN == P11) ? (PWMA_ENO &= ~0x02) : \
  ((PIN == P12) ? (PWMA_ENO &= ~0x04) : \
  ((PIN == P13) ? (PWMA_ENO &= ~0x08) : \
  ((PIN == P14) ? (PWMA_ENO &= ~0x10) : \
  ((PIN == P15) ? (PWMA_ENO &= ~0x20) : \
  ((PIN == P16) ? (PWMA_ENO &= ~0x40) : \
  ((PIN == P17) ? (PWMA_ENO &= ~0x80) : \
  ((PIN == P20) ? (PWMA_ENO &= ~0x01) : \
  ((PIN == P21) ? (PWMA_ENO &= ~0x02) : \
  ((PIN == P22) ? (PWMA_ENO &= ~0x04) : \
  ((PIN == P23) ? (PWMA_ENO &= ~0x08) : \
  ((PIN == P24) ? (PWMA_ENO &= ~0x10) : \
  ((PIN == P25) ? (PWMA_ENO &= ~0x20) : \
  ((PIN == P26) ? (PWMA_ENO &= ~0x40) : \
  ((PIN == P27) ? (PWMA_ENO &= ~0x80) : \
  ((PIN == P34) ? (PWMA_ENO &= ~0x40) : \
  ((PIN == P33) ? (PWMA_ENO &= ~0x80) : \
(0)))))))))))))))))))

#define PWM_write(PIN, val) \
  ((PIN == P10) ? (PWMA_CCR1L =  (val)) : \
  ((PIN == P11) ? (PWMA_CCR1L = ~(val)) : \
  ((PIN == P12) ? (PWMA_CCR2L =  (val)) : \
  ((PIN == P13) ? (PWMA_CCR2L = ~(val)) : \
  ((PIN == P14) ? (PWMA_CCR3L =  (val)) : \
  ((PIN == P15) ? (PWMA_CCR3L = ~(val)) : \
  ((PIN == P16) ? (PWMA_CCR4L =  (val)) : \
  ((PIN == P17) ? (PWMA_CCR4L = ~(val)) : \
  ((PIN == P20) ? (PWMA_CCR1L =  (val)) : \
  ((PIN == P21) ? (PWMA_CCR1L = ~(val)) : \
  ((PIN == P22) ? (PWMA_CCR2L =  (val)) : \
  ((PIN == P23) ? (PWMA_CCR2L = ~(val)) : \
  ((PIN == P24) ? (PWMA_CCR3L =  (val)) : \
  ((PIN == P25) ? (PWMA_CCR3L = ~(val)) : \
  ((PIN == P26) ? (PWMA_CCR4L =  (val)) : \
  ((PIN == P27) ? (PWMA_CCR4L = ~(val)) : \
  ((PIN == P34) ? (PWMA_CCR4L =  (val)) : \
  ((PIN == P33) ? (PWMA_CCR4L = ~(val)) : \
(0)))))))))))))))))))

// ===================================================================================
// ADC functions (P00 - P06, P10, P11, P13 - P17, P54, VREF only)
// ===================================================================================
#define ADC_enable()        ADC_CONTR |=  0x80
#define ADC_disable()       ADC_CONTR &= ~0x80
#define ADC_fast()          ADCTIM = 0b00101010
#define ADC_slow()          ADCTIM = 0b11111111
#define ADC_clockdiv(n)     ADCCFG = (ADCCFG & 0xf0) | ((n) & 0x0f)

#define ADC_input(PIN) \
  ((PIN == P10) ? (ADC_CONTR &= 0xf0) : \
  ((PIN == P11) ? (ADC_CONTR &= 0xf0, ADC_CONTR |= 0x01) : \
  ((PIN == P54) ? (ADC_CONTR &= 0xf0, ADC_CONTR |= 0x02) : \
  ((PIN == P13) ? (ADC_CONTR &= 0xf0, ADC_CONTR |= 0x03) : \
  ((PIN == P14) ? (ADC_CONTR &= 0xf0, ADC_CONTR |= 0x04) : \
  ((PIN == P15) ? (ADC_CONTR &= 0xf0, ADC_CONTR |= 0x05) : \
  ((PIN == P16) ? (ADC_CONTR &= 0xf0, ADC_CONTR |= 0x06) : \
  ((PIN == P17) ? (ADC_CONTR &= 0xf0, ADC_CONTR |= 0x07) : \
  ((PIN == P00) ? (ADC_CONTR &= 0xf0, ADC_CONTR |= 0x08) : \
  ((PIN == P01) ? (ADC_CONTR &= 0xf0, ADC_CONTR |= 0x09) : \
  ((PIN == P02) ? (ADC_CONTR &= 0xf0, ADC_CONTR |= 0x0a) : \
  ((PIN == P03) ? (ADC_CONTR &= 0xf0, ADC_CONTR |= 0x0b) : \
  ((PIN == P04) ? (ADC_CONTR &= 0xf0, ADC_CONTR |= 0x0c) : \
  ((PIN == P05) ? (ADC_CONTR &= 0xf0, ADC_CONTR |= 0x0d) : \
  ((PIN == P06) ? (ADC_CONTR &= 0xf0, ADC_CONTR |= 0x0e) : \
(0))))))))))

#define ADC_input_VREF()    ADC_CONTR |= 0x0f

inline void ADC_init(void) {
  ADC_CONTR = 0x80;
  ADCCFG    = 0x20 | (F_CPU / 3000000);
  ADCTIM    = 0b00101010;
}

inline uint16_t ADC_read(void) {
  ADC_CONTR |= 0x40;
  while(ADC_CONTR & 0x40);
  return (((uint16_t)ADC_RES << 8) | ADC_RESL);
}

inline uint16_t ADC_read_VDD(void) {
  ADC_input_VREF();                             // set VREF as ADC input
  return((uint32_t)1190 * 4095 / ADC_read());   // return VDD in mV
}

// ===================================================================================
// Comparator Functions (POS: P37, ADC-pins / NEG: P36, VREF / OUT: P34, P41)
// ===================================================================================
#define CMP_enable()        CMPCR1 |=  0x80
#define CMP_disable()       CMPCR1 &= ~0x80
#define CMP_read()          (CMPCR1 & 0x01)

#define CMP_pos_pin(PIN) \
  ((PIN == P37) ? (CMPCR1 &= ~0x08) : \
  ((PIN == P10) ? (CMPCR1 |=  0x08, ADC_CONTR &= 0xf0) : \
  ((PIN == P11) ? (CMPCR1 |=  0x08, ADC_CONTR &= 0xf0, ADC_CONTR |= 0x01) : \
  ((PIN == P54) ? (CMPCR1 |=  0x08, ADC_CONTR &= 0xf0, ADC_CONTR |= 0x02) : \
  ((PIN == P13) ? (CMPCR1 |=  0x08, ADC_CONTR &= 0xf0, ADC_CONTR |= 0x03) : \
  ((PIN == P14) ? (CMPCR1 |=  0x08, ADC_CONTR &= 0xf0, ADC_CONTR |= 0x04) : \
  ((PIN == P15) ? (CMPCR1 |=  0x08, ADC_CONTR &= 0xf0, ADC_CONTR |= 0x05) : \
  ((PIN == P16) ? (CMPCR1 |=  0x08, ADC_CONTR &= 0xf0, ADC_CONTR |= 0x06) : \
  ((PIN == P17) ? (CMPCR1 |=  0x08, ADC_CONTR &= 0xf0, ADC_CONTR |= 0x07) : \
  ((PIN == P00) ? (CMPCR1 |=  0x08, ADC_CONTR &= 0xf0, ADC_CONTR |= 0x08) : \
  ((PIN == P01) ? (CMPCR1 |=  0x08, ADC_CONTR &= 0xf0, ADC_CONTR |= 0x09) : \
  ((PIN == P02) ? (CMPCR1 |=  0x08, ADC_CONTR &= 0xf0, ADC_CONTR |= 0x0a) : \
  ((PIN == P03) ? (CMPCR1 |=  0x08, ADC_CONTR &= 0xf0, ADC_CONTR |= 0x0b) : \
  ((PIN == P04) ? (CMPCR1 |=  0x08, ADC_CONTR &= 0xf0, ADC_CONTR |= 0x0c) : \
  ((PIN == P05) ? (CMPCR1 |=  0x08, ADC_CONTR &= 0xf0, ADC_CONTR |= 0x0d) : \
  ((PIN == P06) ? (CMPCR1 |=  0x08, ADC_CONTR &= 0xf0, ADC_CONTR |= 0x0e) : \
(0)))))))))))

#define CMP_neg_pin(PIN)    ((PIN == P36) ? (CMPCR1 |= 0x04) : (CMPCR1 &= ~0x04))
#define CMP_neg_VREF()      CMPCR1 &= ~0x04

#define CMP_out_pin(PIN)    ((PIN == P34) ? (P_SW2 &= f7) : ((PIN == P41) ? (P_SW2 |= 0x08) : (0)))
#define CMP_out_enable()    CMPCR1 |=  0x02
#define CMP_out_disable()   CMPCR1 &= ~0x02
#define CMP_out_invert()    CMPCR2 |=  0x80
#define CMP_out_noninvert() CMPCR2 &= ~0x80
